IntergatedCircuits/STM32_XPD/STM32F3_XPD/src/xpd_adc.c
/**
  ******************************************************************************
  * @file    xpd_adc.c
  * @author  Benedek Kupper
  * @version V0.1
  * @date    2016-02-04
  * @brief   STM32 eXtensible Peripheral Drivers Analog Digital Converter Module
  *
  *  This file is part of STM32_XPD.
  *
  *  STM32_XPD is free software: you can redistribute it and/or modify
  *  it under the terms of the GNU General Public License as published by
  *  the Free Software Foundation, either version 3 of the License, or
  *  (at your option) any later version.
  *
  *  STM32_XPD is distributed in the hope that it will be useful,
  *  but WITHOUT ANY WARRANTY; without even the implied warranty of
  *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  *  GNU General Public License for more details.
  *
  *  You should have received a copy of the GNU General Public License
  *  along with STM32_XPD.  If not, see <http://www.gnu.org/licenses/>.
  */

#include "xpd_adc.h"
#include "xpd_rcc.h"
#include "xpd_utils.h"

#if defined(USE_XPD_ADC)

/** @addtogroup ADC
 * @{ */

/** @addtogroup ADC_Core
 * @{ */

#define ADC_STAB_DELAY_US           10
#define ADC_TEMPSENSOR_DELAY_US     10
#define ADC_CALIBRATION_TIMEOUT     10
#define ADC_CONVERSION_TIME_MAX_CPU_CYCLES ((uint32_t) 156928)
#define ADC_STOP_CONVERSION_TIMEOUT 11

#define ADC_STARTCTRL          (ADC_CR_ADSTART | ADC_CR_JADSTART)
#define ADC_STOPCTRL           (ADC_CR_ADSTP | ADC_CR_JADSTP)
#define ADC_ENDFLAG_SEQUENCE   (ADC_IER_EOSIE | ADC_IER_JEOSIE)
#define ADC_ENDFLAG_CONVERSION (ADC_IER_EOCIE | ADC_IER_JEOCIE)

#if defined(ADC34_COMMON)

#define ADC_COUNT 4

#define ADC_INDEX(HANDLE)   \
    ((((((uint32_t)(HANDLE)->Inst) > ADC2_BASE) ? \
    (((uint32_t)(HANDLE)->Inst) - 0x200) : \
        ((uint32_t)(HANDLE)->Inst)) >> 8) & 3)

#define ADC_COMMON(HANDLE)  \
  ((((uint32_t)(HANDLE)->Inst) > ADC2_BASE) ? (ADC34_COMMON) : (ADC12_COMMON))

#define ADC_COMMON_REG_BIT(HANDLE, REG_NAME, BIT_NAME)  \
    ((ADC_COMMON(HANDLE))->REG_NAME.b.BIT_NAME)

#define ADC_PAIR(HANDLE) (((((uint32_t)(HANDLE)->Inst) & 0x100) != 0) ? \
        ((ADC_TypeDef *)(((uint32_t)(HANDLE)->Inst) & (~0x100))) : \
        ((ADC_TypeDef *)(((uint32_t)(HANDLE)->Inst) | 0x100)))

#define ADC_MULTI_CFGR(HANDLE, DUAL)    \
    (((DUAL) == ADC_MULTIMODE_SINGE) || (IS_ADC_MULTIMODE_MASTER_INSTANCE((HANDLE)->Inst))) ? \
        (HANDLE)->Inst->CFGR.w : ADC_PAIR(HANDLE)->CFGR.w)

#elif defined(ADC12_COMMON)

#define ADC_COUNT 2

#define ADC_INDEX(HANDLE)   \
    (((((uint32_t)(HANDLE)->Inst)) >> 8) & 3)

#define ADC_COMMON(HANDLE)  \
    (ADC12_COMMON)

#define ADC_COMMON_REG_BIT(HANDLE, REG_NAME, BIT_NAME)  \
    ((ADC_COMMON(HANDLE))->REG_NAME.b.BIT_NAME)

#define ADC_PAIR(HANDLE) (((((uint32_t)(HANDLE)->Inst) & 0x100) != 0) ? \
        ((ADC_TypeDef *)(((uint32_t)(HANDLE)->Inst) & (~0x100))) : \
        ((ADC_TypeDef *)(((uint32_t)(HANDLE)->Inst) | 0x100)))

#elif defined(ADC1_COMMON)

#define ADC_COUNT 1

#define ADC_INDEX(HANDLE)   \
    (0)

#define ADC_COMMON(HANDLE)  \
    (ADC1_COMMON)

#define ADC_COMMON_REG_BIT(HANDLE, REG_NAME, BIT_NAME)  \
    ((ADC_COMMON(HANDLE))->REG_NAME.b.BIT_NAME)

#define ADC_PAIR(HANDLE) NULL

#define ADC_MULTI_CFGR(HANDLE, DUAL)    \
    ((HANDLE)->Inst->CFGR.w)

#endif

#if (ADC_COUNT > 1)
static const XPD_CtrlFnType adc_clkCtrl[] = {
#if (ADC_COUNT == 1)
        XPD_ADC1_ClockCtrl
#elif (ADC_COUNT == 2)
        XPD_ADC12_ClockCtrl
#elif (ADC_COUNT == 4)
        XPD_ADC12_ClockCtrl,
        XPD_ADC34_ClockCtrl
#endif
};

static volatile uint8_t adc_users[] = {
        0,
#if (ADC_COUNT == 4)
        0
#endif
};

static void adc_clockCtrl(ADC_HandleType * hadc, FunctionalState ClockState)
{
    uint8_t adcx = ADC_INDEX(hadc);

    if (ClockState == DISABLE)
    {
        CLEAR_BIT(adc_users[adcx / 2], 1 << adcx);
    }
    else
    {
        SET_BIT(adc_users[adcx / 2], 1 << adcx);
    }

    adc_clkCtrl[adcx / 2]((adc_users[adcx / 2] > 0) ? ENABLE : DISABLE);
}
#else
static void adc_clockCtrl(ADC_HandleType * hadc, FunctionalState ClockState)
{
    XPD_ADC1_ClockCtrl(ClockState);
}
#endif

__STATIC_INLINE uint32_t adc_getMultiCfgr(ADC_HandleType * hadc, uint32_t dual)
{
    uint32_t cfgr;
    /* Get relevant register CFGR in ADC instance of ADC master or slave
     * in function of multimode state (for devices with multimode available). */
    if (    (dual == ADC_MULTIMODE_SINGE)
         || (IS_ADC_MULTIMODE_MASTER_INSTANCE(hadc->Inst)))
    {
        cfgr = hadc->Inst->CFGR.w;
    }
    else
    {
        cfgr = ADC_PAIR(hadc)->CFGR.w;
    }
    return cfgr;
}

static void adc_dmaConversionRedirect(void *hdma)
{
    ADC_HandleType* hadc = (ADC_HandleType*) ((DMA_HandleType*) hdma)->Owner;

    hadc->ActiveConversions = 0;

    XPD_SAFE_CALLBACK(hadc->Callbacks.ConvComplete, hadc);
}

#ifdef USE_XPD_DMA_ERROR_DETECT
static void adc_dmaErrorRedirect(void *hdma)
{
    ADC_HandleType* hadc = (ADC_HandleType*) ((DMA_HandleType*) hdma)->Owner;

    XPD_SAFE_CALLBACK(hadc->Callbacks.Error, hadc);
}
#endif

/* Enables the peripheral */
boolean_t adcx_enable(ADC_TypeDef * ADCx)
{
    /* Requirements:
     * ADCAL, ADSTP, JADSTP, ADSTART, JADSTART, ADDIS, ADEN = 0 */
    boolean_t success = (0 == (ADCx->CR.w & (ADC_CR_ADEN | ADC_STARTCTRL | ADC_STOPCTRL | ADC_CR_ADCAL | ADC_CR_ADDIS)));
    if (success)
    {
        SET_BIT(ADCx->CR.w, ADC_CR_ADEN);
    }
    return success;
}

/* Disables the peripheral */
boolean_t adcx_disable(ADC_TypeDef * ADCx)
{
    /* Requirements:
     * ADEN = 1, ADSTART, JADSTART = 0 */
    boolean_t success = (ADC_CR_ADEN == (ADCx->CR.w & (ADC_CR_ADEN | ADC_STARTCTRL)));
    if (success)
    {
        SET_BIT(ADCx->CR.w, ADC_CR_ADDIS);
        SET_BIT(ADCx->ISR.w, ADC_ISR_EOSMP | ADC_ISR_ADRDY);
    }
    return success;
}

static void adc_sequencerConfig(ADC_HandleType * hadc, uint8_t Channel, uint8_t Rank)
{
    uint32_t regoffset, rankm, choffset;

    /* channel configuration for a given rank */
    if (Rank < 5)
    {
        regoffset = 0;
        rankm = 0;
    }
    else if (Rank < 10)
    {
        regoffset = 1;
        rankm = 5;
    }
    else if (Rank < 15)
    {
        regoffset = 2;
        rankm = 10;
    }
    else
    {
        regoffset = 3;
        rankm = 15;
    }

    /* set the channel for the selected rank */
    choffset = (Rank - rankm) * 6;
    MODIFY_REG((&hadc->Inst->SQR1.w)[regoffset], ADC_SQR2_SQ5 << choffset, Channel << choffset);
}

static void adc_sampleTimeConfig(ADC_HandleType * hadc, uint8_t Channel, ADC_SampleTimeType SampleTime)
{
    uint32_t regoffset = 0;

