IntergatedCircuits/STM32_XPD/STM32F3_XPD/src/xpd_adc.c
    /* Channel sampling time configuration */
    if (Channel > 10)
    {
        regoffset = 1;
        Channel -= 10;
    }
    Channel *= 3;

    /* set the sample time */
    MODIFY_REG((&hadc->Inst->SMPR1.w)[regoffset], ADC_SMPR1_SMP0  << Channel, SampleTime << Channel);
}

static void adc_initInternalChannel(ADC_HandleType * hadc, uint32_t Channel)
{
    uint32_t chbit = 0;

    switch (Channel)
    {
        case ADC_VBAT_CHANNEL:
            /* enable the VBAT input */
            if (hadc->Inst == ADC1)
            { chbit = ADC_CCR_VBATEN; }
            break;

        case ADC_VREFINT_CHANNEL:
            /* enable the VREF input */
            { chbit = ADC_CCR_VREFEN; }
            break;

        case ADC_TEMPSENSOR_CHANNEL:
            /* enable the TS input */
            if (hadc->Inst == ADC1)
            { chbit = ADC_CCR_TSEN; }
            break;

        default:
            break;
    }

    /* Check if setting is valid */
    if (((chbit != 0) && ((ADC_COMMON(hadc)->CCR.w & chbit) == 0))
        /* Software is allowed to change common parameters only when all ADCs
         * of the common group are disabled */
        &&  (ADC_REG_BIT(hadc, CR, ADEN) == 0)
#if ADC_COUNT > 1
         && (ADC_PAIR(hadc)->CR.b.ADEN == 0)
#endif
             )
    {
        SET_BIT(ADC_COMMON(hadc)->CCR.w, chbit);

        if (Channel == ADC_TEMPSENSOR_CHANNEL)
        {
            /* wait temperature sensor stabilization */
            XPD_Delay_us(ADC_TEMPSENSOR_DELAY_US);
        }
    }
}

static void adc_stopConversion(ADC_HandleType * hadc, uint32_t convFlag)
{
    uint32_t timeout = ADC_STOP_CONVERSION_TIMEOUT;

    /* Verification if ADC is not already stopped */
    if ((hadc->Inst->CR.w & ADC_STARTCTRL) != 0)
    {
        /* In auto-injection mode, regular group stop ADC_CR_ADSTP is used (not 
         * injected group stop ADC_CR_JADSTP) */
        if ((hadc->Inst->CFGR.w & (ADC_CFGR_JAUTO | ADC_CFGR_CONT | ADC_CFGR_AUTDLY))
                               == (ADC_CFGR_JAUTO | ADC_CFGR_CONT | ADC_CFGR_AUTDLY))
        {
            uint32_t counter;

            /* Use stop of regular group */
            convFlag = ADC_CR_ADSTART;

            /* Wait until JEOS=1 (maximum Timeout: 4 injected conversions) */
            for (counter = 0; counter < (ADC_CONVERSION_TIME_MAX_CPU_CYCLES * 4); counter++)
            {
                if (XPD_ADC_GetFlag(hadc, JEOS) == 0)
                {
                    break;
                }
            }

            /* Clear JEOS */
            XPD_ADC_ClearFlag(hadc, JEOS);
        }

        /* Stop potential conversion on going on regular group */
        if (convFlag != ADC_CR_JADSTART)
        {
            /* Software is allowed to set ADSTP only when ADSTART=1 and ADDIS=0 */
            if ((hadc->Inst->CR.w & (ADC_CR_ADSTART | ADC_CR_ADDIS)) == ADC_CR_ADSTART)
            {
                /* Stop conversions on regular group */
                ADC_REG_BIT(hadc, CR, ADSTP) = 1;
            }
        }

        /* Stop potential conversion on going on injected group */
        if (convFlag != ADC_CR_ADSTART)
        {
            /* Software is allowed to set JADSTP only when JADSTART=1 and ADDIS=0 */
            if ((hadc->Inst->CR.w & (ADC_CR_JADSTART | ADC_CR_ADDIS)) == ADC_CR_JADSTART)
            {
                /* Stop conversions on injected group */
                ADC_REG_BIT(hadc, CR, JADSTP) = 1;
            }
        }

        /* Wait for conversion effectively stopped */
        XPD_WaitForMatch(&hadc->Inst->CR.w, convFlag, 0, &timeout);
    }
}

/** @addtogroup ADC_Core_Exported_Functions
 * @{ */

/**
 * @brief Initializes the ADC peripheral using the setup configuration.
 * @param hadc: pointer to the ADC handle structure
 * @param Config: pointer to ADC setup configuration
 * @return ERROR if input is incorrect, OK if success
 */
XPD_ReturnType XPD_ADC_Init(ADC_HandleType * hadc, const ADC_InitType * Config)
{
    XPD_ReturnType result = XPD_ERROR;

    /* enable clock */
    adc_clockCtrl(hadc, ENABLE);

    /* Initialize ADC API internal variables */
    hadc->InjectedSetup.ChannelCount = 0;
    hadc->InjectedSetup.ContextQueue = 0;

    hadc->ActiveConversions = 0;

    /* Set used EndFlag */
    if (Config->EndFlagSelection == ADC_EOC_SEQUENCE)
    {
        hadc->EndFlagSelection = ADC_ENDFLAG_SEQUENCE;
    }
    else
    {
        hadc->EndFlagSelection = ADC_ENDFLAG_CONVERSION;
    }

    /* Enable voltage regulator (if disabled at this step) */
    if (hadc->Inst->CR.b.ADVREGEN != 1)
    {
        /* Disable the ADC (if not already disabled) */
        (void)adcx_disable(hadc->Inst);

        /* Check if ADC is effectively disabled */
        if (ADC_REG_BIT(hadc, CR, ADEN) == 0)
        {
            /* ADC voltage regulator enable sequence */
            hadc->Inst->CR.b.ADVREGEN = 0;
            hadc->Inst->CR.b.ADVREGEN = 1;

            /* Delay for ADC stabilization time */
            XPD_Delay_us(ADC_STAB_DELAY_US);
        }
    }

    /* ADC regular conversion stopped */
    if (ADC_REG_BIT(hadc, CR, ADSTART) == 0)
    {
        ADC_REG_BIT(hadc, CFGR, CONT)  = Config->ContinuousMode;
        ADC_REG_BIT(hadc, CFGR, ALIGN) = Config->LeftAlignment;
        hadc->Inst->CFGR.b.RES         = Config->Resolution;

        /* external trigger configuration */
        if(Config->Trigger.Source == ADC_TRIGGER_SOFTWARE)
        {
            /* reset the external trigger */
            CLEAR_BIT(hadc->Inst->CFGR.w, ADC_CFGR_EXTSEL | ADC_CFGR_EXTEN);
        }
        else
        {
            /* select external trigger and polarity to start conversion */
            hadc->Inst->CFGR.b.EXTSEL = Config->Trigger.Source;
            hadc->Inst->CFGR.b.EXTEN  = Config->Trigger.Edge;
        }

        /* Enable discontinuous mode only if continuous mode is disabled */
        if ((Config->DiscontinuousCount != 0) && (Config->ContinuousMode == DISABLE))
        {
            ADC_REG_BIT(hadc, CFGR, DISCEN) = 1;
            hadc->Inst->CFGR.b.DISCNUM = Config->DiscontinuousCount - 1;
        }
        else
        {
            CLEAR_BIT(hadc->Inst->CFGR.w, ADC_CFGR_DISCEN | ADC_CFGR_DISCNUM);
        }

        /* No injected or regular conversion ongoing */
        if ((hadc->Inst->CR.w & ADC_STARTCTRL) == 0)
        {
            ADC_REG_BIT(hadc, CFGR, AUTDLY) = Config->LPAutoWait;
            ADC_REG_BIT(hadc, CFGR, DMACFG) = Config->ContinuousDMARequests;
        }

        /* Sequencer configured if scan mode is used */
        if (Config->ScanMode == ENABLE)
        {
            /* Set number of ranks in regular group sequencer */
            hadc->Inst->SQR1.b.L = Config->ConversionCount - 1;
        }
        else
        {
            hadc->Inst->SQR1.b.L = 0;
        }

