IntergatedCircuits/STM32_XPD/STM32F3_XPD/src/xpd_adc.c
        result = XPD_OK;
    }

    /* dependencies initialization */
    XPD_SAFE_CALLBACK(hadc->Callbacks.DepInit, hadc);

    return result;
}

/**
 * @brief Deinitializes the ADC peripheral.
 * @param hadc: pointer to the ADC handle structure
 * @return ERROR if input is incorrect, OK if success
 */
XPD_ReturnType XPD_ADC_Deinit(ADC_HandleType * hadc)
{
    /* Stop potential conversion on going, on regular and injected groups */
    adc_stopConversion(hadc, ADC_STARTCTRL);

    /* Enable injected queue sequencer after injected conversion stop */
    ADC_REG_BIT(hadc, CFGR, JQM) = 1;

    /* Disable the ADC peripheral */
    adcx_disable(hadc->Inst);

    /* Reset register IER */
    hadc->Inst->IER.w = 0;

    /* Reset register ISR */
    hadc->Inst->ISR.w = 0xFFFFFFFF;

    /* Reset OFR registers */
    hadc->Inst->OFR1.w = 0;
    hadc->Inst->OFR2.w = 0;
    hadc->Inst->OFR3.w = 0;
    hadc->Inst->OFR4.w = 0;

    /* Disable voltage regulator */
    CLEAR_BIT(hadc->Inst->CR.w, ADC_CR_ADVREGEN | ADC_CR_ADCALDIF);
    SET_BIT(hadc->Inst->CR.w, ADC_CR_ADVREGEN_1);

    /* Reset register CFGR */
    hadc->Inst->CFGR.w = 0;

    /* Deinitialize peripheral dependencies */
    XPD_SAFE_CALLBACK(hadc->Callbacks.DepDeinit, hadc);

    /* disable clock */
    adc_clockCtrl(hadc, DISABLE);

    return XPD_OK;
}

/**
 * @brief Initializes a regular ADC channel for conversion using the setup configuration.
 * @param hadc: pointer to the ADC handle structure
 * @param Config: pointer to ADC regular channel setup configuration
 */
void XPD_ADC_ChannelConfig(ADC_HandleType * hadc, const ADC_ChannelInitType * Config)
{

    /* No regular conversion ongoing */    if (ADC_REG_BIT(hadc, CR, ADSTART) == 0)
    {
        /* sequencer rank configuration */
        adc_sequencerConfig(hadc, Config->Channel, Config->Rank);

        /* No injected conversion ongoing */        if (ADC_REG_BIT(hadc, CR, JADSTART) == 0)
        {
            /* Channel sampling time configuration */
            adc_sampleTimeConfig(hadc, Config->Channel, Config->SampleTime);
        }

        /* ADC disabled */
        if (hadc->Inst->CR.b.ADEN == 0)
        {
            adc_initInternalChannel(hadc, Config->Channel);

            /* Configuration of differential mode */
            if (Config->Differential != DISABLE)
            {
                /* Enable differential mode */
                SET_BIT(hadc->Inst->DIFSEL.w, 1 << Config->Channel);

                /* Channel sampling time configuration */
                adc_sampleTimeConfig(hadc, Config->Channel + 1, Config->SampleTime);
            }
            else
            {
                /* Disable differential mode (default mode: single-ended) */
                CLEAR_BIT(hadc->Inst->DIFSEL.w, 1 << Config->Channel);
            }
        }
    }
}

/**
 * @brief Sets up or removes an offset configuration for an ADC channel.
 * @param hadc: pointer to the ADC handle structure
 * @param Channel: the selected ADC channel
 * @param Offset: the offset value to set up (or clear if equals 0)
 */
XPD_ReturnType XPD_ADC_ChannelOffsetConfig(ADC_HandleType * hadc, uint32_t Channel, uint16_t Offset)
{
    XPD_ReturnType result = XPD_ERROR;
    union {
        struct {
            __IO uint32_t OFFSET : 12;
                 uint32_t __RESERVED0 : 14;
            __IO uint32_t OFFSET_CH : 5;
            __IO uint32_t OFFSET_EN : 1;
        } b;
        __IO uint32_t w;
    } * pOFR = &hadc->Inst->OFR1.w;

    if ((hadc->Inst->CR.w & ADC_STARTCTRL) == 0)
    {
        uint8_t i;

        /* If offset is 0, remove channel from configuration */
        if (Offset == 0)
        {
            /* Find the channel in the offsets, clear config */
            for (i = 0; i < 4; i++)
            {
                if (pOFR->b.OFFSET_CH == Channel)
                {
                    pOFR->w = 0;
                    result = XPD_OK;
                    break;
                }
                pOFR++;
            }
        }
        /* Add channel offset */
        else
        {
            /* Find an empty offset register, set it up */
            for (i = 0; i < 4; i++)
            {
                if (pOFR->w == 0)
                {
                    pOFR->b.OFFSET = Offset << (hadc->Inst->CFGR.b.RES * 2);
                    pOFR->b.OFFSET_CH = Channel;
                    pOFR->b.OFFSET_EN = 1;
                    result = XPD_OK;
                    break;
                }
                pOFR++;
            }
        }
    }

    return result;
}

/**
 * @brief Enables the ADC peripheral and starts conversion if the trigger is software.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_Start(ADC_HandleType * hadc)
{
    /* Success if not started */
    if (ADC_REG_BIT(hadc, CR, ADSTART) == 0)
    {
        /* ADC turn ON */
        if (adcx_enable(hadc->Inst))
        {
            /* Wait until ADRDY flag is set ( < 1us) */
            uint32_t timeout = 1;
            XPD_WaitForMatch(&hadc->Inst->ISR.w, ADC_ISR_ADRDY, ADC_ISR_ADRDY, &timeout);
        }

        /* clear regular group conversion flag and overrun flag */
        SET_BIT(hadc->Inst->ISR.w, ADC_ISR_EOC | ADC_ISR_EOS | ADC_ISR_OVR);

        /* if ADC is either not in multimode, or the multimode master,
         * enable software conversion of regular channels */
        if (    (ADC_COMMON(hadc)->CCR.b.DUAL == ADC_MULTIMODE_SINGE)
             || (IS_ADC_MULTIMODE_MASTER_INSTANCE(hadc->Inst)))
        {
            ADC_REG_BIT(hadc, CR, ADSTART) = 1;
        }

        /* initialize number of remaining conversions count */
        hadc->ActiveConversions = hadc->Inst->SQR1.b.L + 1;

#if defined(USE_XPD_ADC_ERROR_DETECT) || defined(USE_XPD_DMA_ERROR_DETECT)
        hadc->Errors = ADC_ERROR_NONE;
#endif
    }
}

/**
 * @brief Stops the ADC peripheral.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_Stop(ADC_HandleType * hadc)
{
    uint32_t timeout = 1;

    /* 1. Stop potential conversion on going, on regular and injected groups */
    adc_stopConversion(hadc, ADC_STARTCTRL);

    (void)adcx_disable(hadc->Inst);

