IntergatedCircuits/STM32_XPD/STM32F3_XPD/src/xpd_adc.c
        if (Config->Trigger.InjSource != ADC_INJTRIGGER_SOFTWARE)
        {
            hadc->Inst->JSQR.b.JEXTEN  = Config->Trigger.Edge;
            hadc->Inst->JSQR.b.JEXTSEL = Config->Trigger.InjSource;
            MODIFY_REG(hadc->Inst->JSQR.w,
                    ADC_JSQR_JEXTEN | ADC_JSQR_JEXTSEL | ADC_JSQR_JSQ1,
                    (Config->Trigger.InjSource << 2) | (Config->Trigger.Edge << 4) | jsqr);
        }
    }
    else
    {
        /* 1. Start new context and set parameters related to all injected
         *    channels: injected sequence length and trigger */
        if (hadc->InjectedSetup.ChannelCount == 0)
        {
            /* Initialize number of channels that will be configured on the context
             *  being built */
            hadc->InjectedSetup.ChannelCount = Config->ConversionCount - 1;

            /* Initialize value that will be set into register JSQR */
            hadc->InjectedSetup.ContextQueue = Config->ConversionCount - 1;

            if (Config->Trigger.InjSource != ADC_INJTRIGGER_SOFTWARE)
            {
                MODIFY_REG(hadc->InjectedSetup.ContextQueue,
                        ADC_JSQR_JEXTEN | ADC_JSQR_JEXTSEL,
                        (Config->Trigger.InjSource << 2) | (Config->Trigger.Edge << 4));
            }
        }

        /* 2. Continue setting of context under definition with parameter
         *    related to each channel: channel rank sequence */
        {
            uint32_t channelOffset = (Config->Rank * 6) + 2;
            uint32_t channelMask   = ADC_SQR3_SQ10 << channelOffset;
            uint32_t channelVal    = Config->Channel << channelOffset;

            /* Set the JSQx bits for the selected rank */
            MODIFY_REG(hadc->InjectedSetup.ContextQueue, channelMask, channelVal);
        }

        /* Decrease channel count after setting into temporary JSQR variable */
        hadc->InjectedSetup.ChannelCount--;

        /* 3. End of context setting: If last channel set, then write context
         *    into register JSQR and make it enter into queue */
        if (hadc->InjectedSetup.ChannelCount == 0)
        {
            hadc->Inst->JSQR.w = hadc->InjectedSetup.ContextQueue;
        }
    }

    if (ADC_REG_BIT(hadc, CR, JADSTART) == 0)
    {
        hadc->Inst->CFGR.b.JQM     = Config->ContextQueue;
        hadc->Inst->CFGR.b.JDISCEN = Config->DiscontinuousMode & (!Config->AutoInjection);
    }

    if ((hadc->Inst->CR.w & ADC_STARTCTRL) == 0)
    {
        if (Config->Trigger.InjSource == ADC_INJTRIGGER_SOFTWARE)
        {
            hadc->Inst->CFGR.b.JAUTO = Config->AutoInjection;
        }
        else
        {
            hadc->Inst->CFGR.b.JAUTO = 0;
        }

        /* Channel sampling time configuration */
        adc_sampleTimeConfig(hadc, Config->Channel, Config->SampleTime);

        if (ADC_REG_BIT(hadc, CR, ADEN) == 0)
        {
            /* Configuration of differential mode */
            if (Config->Differential == DISABLE)
            {
                /* Disable differential mode (default mode: single-ended) */
                CLEAR_BIT(hadc->Inst->DIFSEL.w, 1 << Config->Channel);
            }
            else
            {
                /* Enable differential mode */
                SET_BIT(hadc->Inst->DIFSEL.w, 1 << Config->Channel);

                adc_sampleTimeConfig(hadc, Config->Channel + 1, Config->SampleTime);
            }

            adc_initInternalChannel(hadc, Config->Channel);
        }
    }
}

/**
 * @brief Enables the ADC peripheral and starts injected conversion if the trigger is software.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_Injected_Start(ADC_HandleType * hadc)
{
    uint32_t dual = ADC_COMMON(hadc)->CCR.b.DUAL;

    /* Check if ADC peripheral is disabled in order to enable it and wait during
     Tstab time the ADC's stabilization */
    if (ADC_REG_BIT(hadc,CR,JADSTART) == 0)
    {
        /* Enable the Peripheral */
        if (adcx_enable(hadc->Inst))
        {
            /* Delay for ADC stabilization time */
            XPD_Delay_us(ADC_STAB_DELAY_US);
        }
    }

    /* clear injected group conversion flag */
    SET_BIT(hadc->Inst->ISR.w, ADC_ISR_JEOC | ADC_ISR_JEOS | ADC_ISR_JQOVF);

    /* if no external trigger present and ADC is either not in multimode, or the multimode master,
     * enable software conversion of injected channels */
    if ((hadc->Inst->CFGR.b.JAUTO == 0) &&
        (   (dual == ADC_MULTIMODE_SINGE)
         || (dual == ADC_MULTIMODE_DUAL_REGSIMULT)
         || (dual == ADC_MULTIMODE_DUAL_INTERLEAVED)
         || (IS_ADC_MULTIMODE_MASTER_INSTANCE(hadc->Inst))))
    {
        ADC_REG_BIT(hadc,CR,JADSTART) = 1;
    }
}

/**
 * @brief Enables the ADC peripheral and interrupts, and starts injected conversion if the trigger is software.
 * @param hadc: pointer to the ADC handle structure
 */
void XPD_ADC_Injected_Start_IT(ADC_HandleType * hadc)
{
    uint32_t its = hadc->EndFlagSelection & (ADC_IER_JEOCIE | ADC_IER_JEOSIE);
    /* ADC overrun and end of conversion interrupt for regular group */
#ifdef USE_XPD_ADC_ERROR_DETECT
    its |= ADC_IER_JQOVFIE;
#endif
    SET_BIT(hadc->Inst->IER.w, its);

    XPD_ADC_Injected_Start(hadc);
}

/**
 * @brief Return the result of an ADC injected conversion.
 * @param hadc: pointer to the ADC handle structure
 * @param Rank: injected rank of ADC conversion
 * @return The conversion result
 */
uint16_t XPD_ADC_Injected_GetValue(ADC_HandleType * hadc, uint8_t Rank)
{
    /* clear the flag for injected end of conversion */
    XPD_ADC_ClearFlag(hadc, JEOC);

    return (uint16_t)((&hadc->Inst->JDR1)[Rank - 1]);
}

/** @} */

/** @} */

#ifdef ADC12_COMMON
/** @addtogroup ADC_MultiMode
 * @{ */

/** @defgroup ADC_MultiMode_Exported_Functions Multi ADC Mode Exported Functions
 * @{ */

/**
 * @brief Initializes a multi ADC configuration.
 * @param hadc: pointer to the ADC handle structure
 * @param Config: pointer to the multi ADC setup configuration
 */
void XPD_ADC_MultiMode_Init(ADC_HandleType * hadc, const ADC_MultiMode_InitType * Config)
{
    __IO uint32_t * pCR = &ADC_PAIR(hadc)->CR.w;
    ADC_Common_TypeDef *common = ADC_COMMON(hadc);

    /* Neither ADC should be running regular conversion */
    if (    ((hadc->Inst->CR.w & ADC_CR_ADSTART) == 0)
         && ((            *pCR & ADC_CR_ADSTART) == 0))
    {
        common->CCR.b.MDMA = Config->DMAAccessMode;
        common->CCR.b.DMACFG = hadc->Inst->CFGR.b.DMACFG;

        /* Neither ADC should be on */
        if (    ((hadc->Inst->CR.w & ADC_CR_ADEN) == 0)
             && ((            *pCR & ADC_CR_ADEN) == 0))
        {
            common->CCR.b.DUAL  = Config->Mode;
            common->CCR.b.DELAY = Config->InterSamplingDelay;
        }
    }
}

/**
 * @brief Sets up and enables a DMA transfer for the multi ADC regular conversions.
 * @param hadc: pointer to the ADC handle structure
 * @param Address: memory address to the conversion data storage
 * @return ERROR if the DMA is used by other peripheral, OK otherwise
 */
XPD_ReturnType XPD_ADC_MultiMode_Start_DMA(ADC_HandleType * hadc, void * Address)
{
    XPD_ReturnType result = XPD_ERROR;

    /* Perform ADC enable and conversion start if no conversion is on going (check on ADC master only) */
    if ((ADC_REG_BIT(hadc,CR,ADSTART) == 0) && ((ADC_INDEX(hadc) & 1) == 0))
    {
        /* enable both ADCs */
        (void)adcx_enable(hadc->Inst);
        (void)adcx_enable(ADC_PAIR(hadc));

        /* Set up DMA for transfer */
        result = XPD_DMA_Start_IT(hadc->DMA.Conversion, (void *)&ADC_COMMON(hadc)->CDR.w, Address, hadc->Inst->SQR1.b.L + 1);

        /* If the DMA is currently used, return with error */
        if (result == XPD_OK)
        {
            /* Set the callback owner */
            hadc->DMA.Conversion->Owner = hadc;

            /* Set the DMA transfer callbacks */
            hadc->DMA.Conversion->Callbacks.Complete     = adc_dmaConversionRedirect;
#ifdef USE_XPD_DMA_ERROR_DETECT
            hadc->DMA.Conversion->Callbacks.Error        = adc_dmaErrorRedirect;

            /* Enable ADC overrun interrupt */
            XPD_ADC_EnableIT(hadc, OVR);
#endif

            /* Enable the ADC peripherals: master and slave (in case if not already enabled previously) */
            ADC_PAIR(hadc)->CR.b.ADEN = 1;

